spec/fixtures/cancelled_mercadopago_response.json

{
  "status": "200",
  "response": {
    "metadata": {},
    "operation_type": "regular_payment",
    "fee_details": [],
    "notification_url": null,
    "date_approved": null,
    "acquirer": null,
    "money_release_schema": null,
    "payer": {
      "entity_type": null,
      "identification": {},
      "phone": {},
      "operator_id": null,
      "last_name": null,
      "id": "279854323",
      "type": "guest",
      "first_name": null,
      "email": null
    },
    "transaction_details": {
      "total_paid_amount": 21.6,
      "acquirer_reference": null,
      "installment_amount": 0,
      "financial_institution": null,
      "net_received_amount": 0,
      "overpaid_amount": 0,
      "external_resource_url": "http://www.mercadopago.com/mla/payments/ticket/helper?payment_id=4979664041&payment_method_reference_id=4699785335&caller_id=279854323&hash=438f642e-9d89-4be6-9783-4b8d3ea763a3",
      "payable_deferral_period": null,
      "payment_method_reference_id": "4699785335",
      "verification_code": "4699785335"
    },
    "statement_descriptor": null,
    "call_for_authorize_id": null,
    "installments": 1,
    "pos_id": null,
    "external_reference": "afd34bb1-f944-4f68-b64f-d8b9d67980fa",
    "date_of_expiration": null,
    "id": 4979664041,
    "payment_type_id": "ticket",
    "barcode": {
      "width": 1,
      "type": "Code128C",
      "content": "333500880000000MP34699785335100002160191990562",
      "height": 30
    },
    "order": {},
    "counter_currency": null,
    "status_detail": "expired",
    "differential_pricing_id": null,
    "additional_info": {},
    "live_mode": true,
    "card": {},
    "status": "cancelled",
    "transaction_amount_refunded": 0,
    "transaction_amount": 21.6,
    "description": "Pedido Nilus de 'Institucion de prueba' por la orden #5b6dedd7-8562-4d1e-9478-d89cce8fa318",
    "money_release_date": null,
    "merchant_number": null,
    "refunds": [],
    "authorization_code": null,
    "captured": true,
    "collector_id": 442381846,
    "merchant_account_id": null,
    "taxes_amount": 0,
    "date_last_updated": "2019-08-17T14:07:55.000-04:00",
    "coupon_amount": 0,
    "store_id": null,
    "date_created": "2019-07-18T13:56:57.000-04:00",
    "acquirer_reconciliation": [],
    "sponsor_id": null,
    "shipping_amount": 0,
    "issuer_id": null,
    "payment_method_id": "pagofacil",
    "binary_mode": false,
    "deduction_schema": null,
    "processing_mode": "aggregator",
    "currency_id": "ARS",
    "shipping_cost": 0
  }
}