spec/fixtures/created_mercadopago_response.json

{
  "status": "201",
  "response": {
    "id": 21328554,
    "date_created": "2019-08-20T12:06:53.000-04:00",
    "date_approved": null,
    "date_last_updated": "2019-08-20T12:06:53.000-04:00",
    "date_of_expiration": null,
    "money_release_date": null,
    "operation_type": "regular_payment",
    "issuer_id": null,
    "payment_method_id": "pagofacil",
    "payment_type_id": "ticket",
    "status": "pending",
    "status_detail": "pending_waiting_payment",
    "currency_id": "ARS",
    "description": "Pedido Nilus de 'BAR' por la orden #e55037ef-7972-4172-b25f-9f22e8f3dbdd",
    "live_mode": false,
    "sponsor_id": null,
    "authorization_code": null,
    "money_release_schema": null,
    "taxes_amount": 0,
    "counter_currency": null,
    "shipping_amount": 0,
    "pos_id": null,
    "store_id": null,
    "collector_id": 316519508,
    "payer": {
      "first_name": "Test",
      "last_name": "Test",
      "email": "test_user_80507629@testuser.com",
      "identification": {
        "number": "32659430",
        "type": "DNI"
      },
      "phone": {
        "area_code": "01",
        "number": "1111-1111",
        "extension": ""
      },
      "type": "registered",
      "entity_type": null,
      "id": "316534448"
    },
    "metadata": {},
    "additional_info": {},
    "order": {},
    "external_reference": "761daa85-32f0-4e43-8026-35c661e219c9",
    "transaction_amount": 500,
    "transaction_amount_refunded": 0,
    "coupon_amount": 0,
    "differential_pricing_id": null,
    "deduction_schema": null,
    "barcode": {
      "type": "Code128C",
      "content": "33350088000000000MP321328555100050000192320543",
      "width": 1,
      "height": 30
    },
    "transaction_details": {
      "payment_method_reference_id": "21328555",
      "net_received_amount": 0,
      "total_paid_amount": 500,
      "overpaid_amount": 0,
      "external_resource_url": "http://www.mercadopago.com/mla/payments/sandbox/ticket/helper?payment_id=21328554\u0026payment_method_reference_id=21328555\u0026caller_id=316534448\u0026hash=5c472354-939a-43f8-97d3-c51c67a93568",
      "installment_amount": 0,
      "financial_institution": null,
      "payable_deferral_period": null,
      "acquirer_reference": null,
      "verification_code": "21328555"
    },
    "fee_details": [],
    "captured": true,
    "binary_mode": false,
    "call_for_authorize_id": null,
    "statement_descriptor": null,
    "installments": 1,
    "card": {},
    "notification_url": "https://pad.nilus.org/webhooks/mercadopago/payment//webhooks/mercadopago/payment/761daa85-32f0-4e43-8026-35c661e219c9",
    "refunds": [],
    "processing_mode": "aggregator",
    "merchant_account_id": null,
    "acquirer": null,
    "merchant_number": null,
    "acquirer_reconciliation": []
  }
}